["Think for yourself to decide 1) what you want, 2) what is true, and 3) what you should do to achieve #1 in light of #2, and do that with humility and open-mindedness so that you consider the best thinking available to you.",
    "Look to the patterns of those things that affect you in order to understand the cause-effect relationships that drive them and to learn principles for dealing with them effectively.",
    "Be a hyperrealist.",
    "Dreams + Reality + Determination = A Successful Life.",
    "Truth—or, more precisely, an accurate understanding of reality —is the essential foundation for any good outcome.",
    "Be radically open-minded and radically transparent.",
    "Radical open-mindedness and radical transparency are invaluable for rapid learning and effective change.",
    "Don’t let fears of what others think of you stand in your way.",
    "Embracing radical truth and radical transparency will bring more meaningful work and more meaningful relationships.",
    "Look to nature to learn how reality works.",
    "Don’t get hung up on your views of how things “should” be because you will miss out on learning how they really are.",
    "To be “good,” something must operate consistently with the laws of reality and contribute to the evolution of the whole; that is what is most rewarded.",
    "Evolution is the single greatest force in the universe; it is the only thing that is permanent and it drives everything.",
    "Evolve or die.",
    "Evolving is life’s greatest accomplishment and its greatest reward.",
    "The individual’s incentives must be aligned with the group’s goals.",
    "Reality is optimizing for the whole—not for you.",
    "Adaptation through rapid trial and error is invaluable.",
    "Realize that you are simultaneously everything and nothing —and decide what you want to be.",
    "What you will be will depend on the perspective you have.",
    "Understand nature’s practical lessons.",
    "Maximize your evolution.",
    "Remember “no pain, no gain.”",
    "It is a fundamental law of nature that in order to gain strength one has to push one’s limits, which is painful.",
    "Pain + Reflection = Progress.",
    "Go to the pain rather than avoid it.",
    "Embrace tough love.",
    "Weigh second- and third-order consequences.",
    "Own your outcomes.",
    "Look at the machine from the higher level.",
    "Think of yourself as a machine operating within a machine and know that you have the ability to alter your machines to produce better outcomes.",
    "By comparing your outcomes with your goals, you can determine how to modify your machine.",
    "Distinguish between you as the designer of your machine and you as a worker with your machine.",
    "The biggest mistake most people make is to not see themselves and others objectively, which leads them to bump into their own and others’ weaknesses again and again.",
    "Successful people are those who can go above themselves to see things objectively and manage those things to shape change.",
    "Asking others who are strong in areas where you are weak to help you is a great skill that you should develop no matter what, as it will help you develop guardrails that will prevent you from doing what you shouldn’t be doing.",
    "Because it is difficult to see oneself objectively, you need to rely on the input of others and the whole body of evidence.",
    "If you are open-minded enough and determined, you can get virtually anything you want. 2  Use the 5-Step Process to Get What You Want Out of Life",
    "Have clear goals.",
    "Prioritize: While you can have virtually anything you want, you can’t have everything you want.",
    "Don’t confuse goals with desires.",
    "Decide what you really want in life by reconciling your goals and your desires.",
    "Don’t mistake the trappings of success for success itself.",
    "Never rule out a goal because you think it’s unattainable.",
    "Remember that great expectations create great capabilities.",
    "Almost nothing can stop you from succeeding if you have a) flexibility and b) self-accountability.",
    "Knowing how to deal well with your setbacks is as important as knowing how to move forward.",
    "Identify and don’t tolerate problems.",
    "View painful problems as potential improvements that are screaming at you.",
    "Don’t avoid confronting problems because they are rooted in harsh realities that are unpleasant to look at.",
    "Be specific in identifying your problems.",
    "Don’t mistake a cause of a problem with the real problem.",
    "Distinguish big problems from small ones.",
    "Once you identify a problem, don’t tolerate it.",
    "Diagnose problems to get at their root causes.",
    "Focus on the “what is” before deciding “what to do about it.”",
    "Distinguish proximate causes from root causes.",
    "Recognize that knowing what someone (including you) is like will tell you what you can expect from them.",
    "Design a plan.",
    "Go back before you go forward.",
    "Think about your problem as a set of outcomes produced by a machine.",
    "Remember that there are typically many paths to achieving your goals.",
    "Think of your plan as being like a movie script in that you visualize who will do what through time.",
    "Write down your plan for everyone to see and to measure your progress against.",
    "Recognize that it doesn’t take a lot of time to design a good plan.",
    "Push through to completion.",
    "Great planners who don’t execute their plans go nowhere.",
    "Good work habits are vastly underrated.",
    "Establish clear metrics to make certain that you are following your plan.",
    "Remember that weaknesses don’t matter if you find solutions.",
    "Look at the patterns of your mistakes and identify at which step in the 5-Step Process you typically fail.",
    "Everyone has at least one big thing that stands in the way of their success; find yours and deal with it.",
    "Understand your own and others’ mental maps and humility. 3  Be Radically Open-Minded",
    "Recognize your two barriers.",
    "Understand your ego barrier.",
    "Your two “yous” fight to control you.",
    "Understand your blind spot barrier.",
    "Practice radical open-mindedness.",
    "Sincerely believe that you might not know the best possible path and recognize that your ability to deal well with “not knowing” is more important than whatever it is you do know.",
    "Recognize that decision making is a two-step process: First take in all the relevant information, then decide.",
    "Don’t worry about looking good; worry about achieving your goal.",
    "Realize that you can’t put out without taking in.",
    "Recognize that to gain the perspective that comes from seeing things through another’s eyes, you must suspend judgment for a time—only by empathizing can you properly evaluate another point of view.",
    "Remember that you’re looking for the best answer, not simply the best answer that you can come up with yourself.",
    "Be clear on whether you are arguing or seeking to understand, and think about which is most appropriate based on your and others’ believability.",
    "Appreciate the art of thoughtful disagreement.",
    "Triangulate your view with believable people who are willing to disagree.",
    "Plan for the worst-case scenario to make it as good as possible.",
    "Recognize the signs of closed-mindedness and open-mindedness that you should watch out for.",
    "Understand how you can become radically open-minded.",
    "Regularly use pain as your guide toward quality reflection.",
    "Make being open-minded a habit.",
    "Get to know your blind spots.",
    "If a number of different believable people say you are doing something wrong and you are the only one who doesn’t see it that way, assume that you are probably biased.",
    "Meditate.",
    "Be evidence-based and encourage others to be the same.",
    "Do everything in your power to help others also be open-minded.",
    "Use evidence-based decision-making tools.",
    "Know when it’s best to stop fighting and have faith in your decision-making process.",
    "Understand the power that comes from knowing how you and others are wired.",
    "We are born with attributes that can both help us and hurt us, depending on their application.",
    "Meaningful work and meaningful relationships aren’t just nice things we chose for ourselves—they are genetically programmed into us.",
    "Understand the great brain battles and how to control them to get what “you” want.",
    "Realize that the conscious mind is in a battle with the subconscious mind.",
    "Know that the most constant struggle is between feeling and thinking.",
    "Reconcile your feelings and your thinking.",
    "Choose your habits well.",
    "Train your “lower-level you” with kindness and persistence to build the right habits.",
    "Understand the differences between right-brained and left-brained thinking.",
    "Understand how much the brain can and cannot change.",
    "Find out what you and others are like.",
    "Introversion vs. extroversion.",
    "Intuiting vs. sensing.",
    "Thinking vs. feeling.",
    "Planning vs. perceiving.",
    "Creators vs. refiners vs. advancers vs. executors vs. flexors.",
    "Focusing on tasks vs. focusing on goals.",
    "Workplace Personality Inventory.",
    "Shapers are people who can go from visualization to actualization.",
    "Getting the right people in the right roles in support of your goal is the key to succeeding at whatever you choose to accomplish.",
    "Manage yourself and orchestrate others to get what you want.",
    "Recognize that 1) the biggest threat to good decision making is harmful emotions, and 2) decision making is a two-step process (first learning and then deciding).",
    "Synthesize the situation at hand.",
    "One of the most important decisions you can make is who you ask questions of.",
    "Don’t believe everything you hear.",
    "Everything looks bigger up close.",
    "New is overvalued relative to great.",
    "Don’t oversqueeze dots.",
    "Synthesize the situation through time.",
    "Keep in mind both the rates of change and the levels of things, and the relationships between them.",
    "Be imprecise.",
    "Remember the 80/20 Rule and know what the key 20 percent is.",
    "Be an imperfectionist.",
    "Navigate levels effectively.",
    "Use the terms “above the line” and “below the line” to establish which level a conversation is on.",
    "Remember that decisions need to be made at the appropriate level, but they should also be consistent across levels.",
    "Logic, reason, and common sense are your best tools for synthesizing reality and understanding what to do about it.",
    "Make your decisions as expected value calculations.",
    "Raising the probability of being right is valuable no matter what your probability of being right already is.",
    "Knowing when not to bet is as important as knowing what bets are probably worth making.",
    "The best choices are the ones that have more pros than cons, not those that don’t have any cons at all.",
    "Prioritize by weighing the value of additional information against the cost of not deciding.",
    "All of your “must-dos” must be above the bar before you do your “like-to-dos.”",
    "Chances are you won’t have time to deal with the unimportant things, which is better than not having time        to deal with the important things.",
    "Don’t mistake possibilities for probabilities.",
    "Simplify!",
    "Use principles.",
    "Believability weight your decision making.",
    "Convert your principles into algorithms and have the computer make decisions alongside you.",
    "Be cautious about trusting AI without having deep understanding.",
    "An organization is a machine consisting of two major parts: culture and people.",
    "A great organization has both great people and a great culture.",
    "Great people have both great character and great capabilities.",
    "Great cultures bring problems and disagreements to the surface and solve them well, and they love imagining and building great things that haven’t been built before. Tough love is effective for achieving both great work and great relationships.",
    "In order to be great, one can’t compromise the uncompromisable. A believability-weighted idea meritocracy is the best system for making effective decisions. Make your passion and your work one and the same and do it with people you want to be with.",
    "Realize that you have nothing to fear from knowing the truth.",
    "Have integrity and demand it from others.",
    "Never say anything about someone that you wouldn’t say to them directly and don’t try people without accusing them to their faces.",
    "Don’t let loyalty to people stand in the way of truth and the well-being of the organization.",
    "Create an environment in which everyone has the right to understand what makes sense and no one has the right to hold a critical opinion without speaking up.",
    "Speak up, own it, or get out.",
    "Be extremely open.",
    "Don’t be naive about dishonesty.",
    "Be radically transparent.",
    "Use transparency to help enforce justice.",
    "Share the things that are hardest to share.",
    "Keep exceptions to radical transparency very rare.",
    "Make sure those who are given radical transparency recognize their responsibilities to handle it well and to weigh things intelligently.",
    "Provide transparency to people who handle it well and either deny it to people who don’t handle it well or remove those people from the organization.",
    "Don’t share sensitive information with the organization’s enemies.",
    "Meaningful relationships and meaningful work are mutually reinforcing, especially when supported by radical truth and radical transparency.",
    "Be loyal to the common mission and not to anyone who is not operating consistently with it.",
    "Be crystal clear on what the deal is.",
    "Make sure people give more consideration to others than they demand for themselves.",
    "Make sure that people understand the difference between fairness and generosity.",
    "Know where the line is and be on the far side of fair.",
    "Pay for work.",
    "Recognize that the size of the organization can pose a threat to meaningful relationships.",
    "Remember that most people will pretend to operate in your interest while operating in their own.",
    "Treasure honorable people who are capable and will treat you well even when you’re not looking.",
    "Recognize that mistakes are a natural part of the evolutionary process.",
    "Fail well.",
    "Don’t feel bad about your mistakes or those of others. Love them!",
    "Don’t worry about looking good—worry about achieving your goals.",
    "Get over “blame” and “credit” and get on with “accurate” and “inaccurate.”",
    "Observe the patterns of mistakes to see if they are products of weaknesses.",
    "Remember to reflect when you experience pain.",
    "Be self-reflective and make sure your people are self-reflective.",
    "Know that nobody can see themselves objectively.",
    "Teach and reinforce the merits of mistake-based learning.",
    "Know what types of mistakes are acceptable and what types are unacceptable, and don’t allow the people who work for you to make the unacceptable ones.",
    "Recognize that conflicts are essential for great relationships because they are how people determine whether their principles are aligned and resolve their differences.",
    "Spend lavishly on the time and energy you devote to getting in sync, because it’s the best investment you can make.",
    "Know how to get in sync and disagree well.",
    "Surface areas of possible out-of-syncness.",
    "Distinguish between idle complaints and complaints meant to lead to improvement.",
    "Remember that every story has another side.",
    "Be open-minded and assertive at the same time.",
    "Distinguish open-minded people from closed-minded people.",
    "Don’t have anything to do with closed-minded people.",
    "Watch out for people who think it’s embarrassing not to know.",
    "Make sure that those in charge are open-minded about the questions and comments of others.",
    "Recognize that getting in sync is a two-way responsibility.",
    "Worry more about substance than style.",
    "Be reasonable and expect others to be reasonable.",
    "Making suggestions and questioning are not the same as criticizing, so don’t treat them as if they are.",
    "If it is your meeting to run, manage the conversation.",
    "Make it clear who is directing the meeting and whom it is meant to serve.",
    "Be precise in what you’re talking about to avoid confusion.",
    "Make clear what type of communication you are going to have in light of the objectives and priorities.",
    "Lead the discussion by being assertive and open-minded.",
    "Navigate between the different levels of the conversation.",
    "Watch out for “topic slip.”",
    "Enforce the logic of conversations.",
    "Be careful not to lose personal responsibility via group decision making.",
    "Utilize the “two-minute rule” to avoid persistent interruptions.",
    "Watch out for assertive “fast talkers.”",
    "Achieve completion in conversations.",
    "Leverage your communication.",
    "Great collaboration feels like playing jazz.",
    "1+1=3.",
    "3 to 5 is more than 20.",
    "When you have alignment, cherish it.",
    "If you find you can’t reconcile major differences—especially in values—consider whether the relationship is worth preserving.",
    "Recognize that having an effective idea meritocracy requires that you understand the merit of each person’s ideas.",
    "If you can’t successfully do something, don’t think you can tell others how it should be done.",
    "Remember that everyone has opinions and they are often bad.",
    "Find the most believable people possible who disagree with you and try to understand their reasoning.",
    "Think about people’s believability in order to assess the likelihood that their opinions are good.",
    "Remember that believable opinions are most likely to come from people 1) who have successfully accomplished the thing in question at least three times, and 2) who have great explanations of the cause-effect relationships that lead them to         their conclusions.",
    "If someone hasn’t done something but has a theory that seems logical and can be stress-tested, then by all means test it.",
    "Don’t pay as much attention to people’s conclusions as to the reasoning that led them to their conclusions.",
    "Inexperienced people can have great ideas too, sometimes far better ones than more experienced people.",
    "Everyone should be up-front in expressing how confident they are in their thoughts.",
    "Think about whether you are playing the role of a teacher, a student, or a peer and whether you should be teaching, asking questions, or debating.",
    "It’s more important that the student understand the teacher than that the teacher understand the student, though both are important.",
    "Recognize that while everyone has the right and responsibility to try to make sense of important things, they must do so with humility and radical open-mindedness.",
    "Understand how people came by their opinions.",
    "If you ask someone a question, they will probably give you an answer, so think through to whom you should address your questions.",
    "Having everyone randomly probe everyone else is an unproductive waste of time.",
    "Beware of statements that begin with “I think that . . .”",
    "Assess believability by systematically capturing people’s track records over time.",
    "Disagreeing must be done efficiently.",
    "Know when to stop debating and move on to agreeing about what should be done.",
    "Use believability weighting as a tool rather than a substitute for decision making by Responsible Parties.",
    "Since you don’t have the time to thoroughly examine everyone’s thinking yourself, choose your believable people wisely.",
    "When you’re responsible for a decision, compare the believability-weighted decision making of the crowd to what you believe.",
    "Recognize that everyone has the right and responsibility to try to make sense of important things.",
    "Communications aimed at getting the best answer should involve the most relevant people.",
    "Communication aimed at educating or boosting cohesion should involve a broader set of people than would be needed if the aim were just getting the best answer.",
    "Recognize that you don’t need to make judgments about everything.",
    "Pay more attention to whether the decision-making system is fair than whether you get your way.",
    "Remember: Principles can’t be ignored by mutual agreement.",
    "The same standards of behavior apply to everyone.",
    "Make sure people don’t confuse the right to complain, give advice, and openly debate with the right to make decisions.",
    "When challenging a decision and/or a decision maker, consider the broader context.",
    "Don’t leave important conflicts unresolved.",
    "Don’t let the little things divide you when your agreement on the big things should bind you.",
    "Don’t get stuck in disagreement—escalate or vote!",
    "Once a decision is made, everyone should get behind it even though individuals may still disagree.",
    "See things from the higher level.",
    "Never allow the idea meritocracy to slip into anarchy.",
    "Don’t allow lynch mobs or mob rule.",
    "Remember that if the idea meritocracy comes into conflict with the well-being of the organization, it will inevitably suffer.",
    "Declare “martial law” only in rare or extreme circumstances when the principles need to be suspended.",
    "Be wary of people who argue for the suspension of the idea meritocracy for the “good of the organization.”",
    "Recognize that if the people who have the power don’t want to operate by principles, the principled way of operating will fail.",
    "Recognize that the most important decision for you to make is who you choose as your Responsible Parties.",
    "Understand that the most important RPs are those responsible for the goals, outcomes, and machines at the highest levels.",
    "Know that the ultimate Responsible Party will be the person who bears the consequences of what is done.",
    "Make sure that everyone has someone they report to.",
    "Remember the force behind the thing. 8  Hire Right, Because the Penalties for Hiring Wrong Are Huge",
    "Match the person to the design.",
    "Think through which values, abilities, and skills you are looking for (in that order).",
    "Make finding the right people systematic and scientific.",
    "Hear the click: Find the right fit between the role and the person.",
    "Look for people who sparkle, not just “any ol’ one of those.”",
    "Don’t use your pull to get someone a job.",
    "Remember that people are built very differently and that different ways of seeing and thinking make people suitable for different jobs.",
    "Understand how to use and interpret personality assessments.",
    "Remember that people tend to pick people like themselves, so choose interviewers who can identify what you are looking for.",
    "Look for people who are willing to look at themselves objectively.",
    "Remember that people typically don’t change all that much.",
    "Think of your teams the way that sports managers do: No one person possesses everything required to produce success, yet everyone must excel.",
    "Pay attention to people’s track records.",
    "Check references.",
    "Recognize that performance in school doesn’t tell you much about whether a person has the values and abilities you are looking for.",
    "While it’s best to have great conceptual thinkers, understand that great experience and a great track record also count for a lot.",
    "Beware of the impractical idealist.",
    "Don’t assume that a person who has been successful elsewhere will be successful in the job you’re giving them.",
    "Make sure your people have character and are capable.",
    "Don’t hire people just to fit the first job they will do; hire people you want to share your life with.",
    "Look for people who have lots of great questions.",
    "Show candidates your warts.",
    "Play jazz with people with whom you are compatible but who will also challenge you.",
    "When considering compensation, provide both stability and opportunity.",
    "Pay for the person, not the job.",
    "Have performance metrics tied at least loosely to compensation.",
    "Pay north of fair.",
    "Focus more on making the pie bigger than on exactly how to slice it so that you or anyone else gets the biggest piece.",
    "Remember that in great partnerships, consideration and generosity are more important than money.",
    "Be generous and expect generosity from others.",
    "Great people are hard to find so make sure you think about how to keep them. 9  Constantly Train, Test, Evaluate, and Sort People",
    "Understand that you and the people you manage will go through a process of personal evolution.",
    "Recognize that personal evolution should be relatively rapid and a natural consequence of discovering one’s strengths and weaknesses; as a result, career paths are not planned at the outset.",
    "Understand that training guides the process of personal evolution.",
    "Teach your people to fish rather than give them fish, even if that means letting them make some mistakes.",
    "Recognize that experience creates internalized learning that book learning can’t replace.",
    "Provide constant feedback.",
    "Evaluate accurately, not kindly.",
    "In the end, accuracy and kindness are the same thing.",
    "Put your compliments and criticisms in perspective.",
    "Think about accuracy, not implications.",
    "Make accurate assessments.",
    "Learn from success as well as from failure.",
    "Know that most everyone thinks that what they did, and what they are doing, is much more important than it really is.",
    "Recognize that tough love is both the hardest and the most important type of love to give (because it is so rarely welcomed).",
    "Recognize that while most people prefer compliments, accurate criticism is more valuable.",
    "Don’t hide your observations about people.",
    "Build your synthesis from the specifics up.",
    "Squeeze the dots.",
    "Don’t oversqueeze a dot.",
    "Use evaluation tools such as performance surveys, metrics, and formal reviews to document all aspects of a person’s performance.",
    "Make the process of learning what someone is like open, evolutionary, and iterative.",
    "Make your metrics clear and impartial.",
    "Encourage people to be objectively reflective about their performance.",
    "Look at the whole picture.",
    "For performance reviews, start from specific cases, look for patterns, and get in sync with the person being reviewed by looking at the evidence together.",
    "Remember that when it comes to assessing people, the two biggest mistakes you can make are being overconfident in your assessment and failing to get in sync on it.",
    "Get in sync on assessments in a nonhierarchical way.",
    "Learn about your people and have them learn about you through frank conversations about mistakes and their root causes.",
    "Understand that making sure people are doing a good job doesn’t require watching everything that everybody is doing at all times.",
    "Recognize that change is difficult.",
    "Help people through the pain that comes with exploring their weaknesses.",
    "Knowing how people operate and being able to judge whether that way of operating will lead to good results is more important than knowing what they did.",
    "If someone is doing their job poorly, consider whether it is due to inadequate learning or inadequate ability.",
    "Training and testing a poor performer to see if he or she can acquire the required skills without simultaneously trying to assess their abilities is a common mistake.",
    "Recognize that when you are really in sync with someone about their weaknesses, the weaknesses are probably true.",
    "When judging people, remember that you don’t have to get to the point of “beyond a shadow of a doubt.”",
    "It should take you no more than a year to learn what a person is like and whether they are a click for their job.",
    "Continue assessing people throughout their tenure.",
    "Evaluate employees with the same rigor as you evaluate job candidates.",
    "Train, guardrail, or remove people; don’t rehabilitate them.",
    "Don’t collect people.",
    "Be willing to “shoot the people you love.”",
    "When someone is “without a box,” consider whether there is an open box that would be a better fit or whether you need to get them out of the company.",
    "Be cautious about allowing people to step back to another role after failing.",
    "Remember that the goal of a transfer is the best, highest use of the person in a way that benefits the community as a whole.",
    "Have people “complete their swings” before moving on to new roles.",
    "Don’t lower the bar. 10  Manage as Someone Operating a Machine to Achieve a Goal",
    "Look down on your machine and yourself within it from the higher level.",
    "Constantly compare your outcomes to your goals.",
    "Understand that a great manager is essentially an organizational engineer.",
    "Build great metrics.",
    "Beware of paying too much attention to what is coming at you and not enough attention to your machine.",
    "Don’t get distracted by shiny objects.",
    "Remember that for every case you deal with, your approach should have two purposes: 1) to move you closer to your goal, and 2) to train and test your machine (i.e., your people and your design).",
    "Everything is a case study.",
    "When a problem occurs, conduct the discussion at two levels: 1) the machine level (why that outcome was produced) and 2) the case-at-hand level (what to do about it).",
    "When making rules, explain the principles behind them.",
    "Your policies should be natural extensions of your principles.",
    "While good principles and policies almost always provide good guidance, remember that there are exceptions to every rule.",
    "Understand the differences between managing, micromanaging, and not managing.",
    "Managers must make sure that what they are responsible for works well.",
    "Managing the people who report to you should feel like skiing together.",
    "An excellent skier is probably going to be a better ski coach than a novice skier.",
    "You should be able to delegate the details.",
    "Know what your people are like and what makes them tick, because your people are your most important resource.",
    "Regularly take the temperature of each person who is important to you and to the organization.",
    "Learn how much confidence to have in your people—don’t assume it.",
    "Vary your involvement based on your confidence.",
    "Clearly assign responsibilities.",
    "Remember who has what responsibilities.",
    "Watch out for “ job slip.”",
    "Probe deep and hard to learn what you can expect from your machine.",
    "Get a threshold level of understanding.",
    "Avoid staying too distant.",
    "Use daily updates as a tool for staying on top of what your people are doing and thinking.",
    "Probe so you know whether problems are likely to occur before they actually do.",
    "Probe to the level below the people who report to you.",
    "Have the people who report to the people who report to you feel free to escalate their problems to you.",
    "Don’t assume that people’s answers are correct.",
    "Train your ear.",
    "Make your probing transparent rather than private.",
    "Welcome probing.",
    "Remember that people who see things and think one way often have difficulty communicating with and relating to people who see things and think another way.",
    "Pull all suspicious threads.",
    "Recognize that there are many ways to skin a cat.",
    "Think like an owner, and expect the people you work with to do the same.",
    "Going on vacation doesn’t mean one can neglect one’s responsibilities.",
    "Force yourself and the people who work for you to do difficult things.",
    "Recognize and deal with key-man risk.",
    "Don’t treat everyone the same—treat them appropriately.",
    "Don’t let yourself get squeezed.",
    "Care about the people who work for you.",
    "Know that great leadership is generally not what it’s made out to be.",
    "Be weak and strong at the same time.",
    "Don’t worry about whether or not your people like you and don’t look to them to tell you what you should do.",
    "Don’t give orders and try to be followed; try to be understood and to understand others by getting in sync.",
    "Hold yourself and your people accountable and appreciate them for holding you accountable.",
    "If you’ve agreed with someone that something is supposed to go a certain way, make sure it goes that way—unless you get in sync about doing it differently.",
    "Distinguish between a failure in which someone broke their “contract” and a failure in which there was no contract to begin with.",
    "Avoid getting sucked down.",
    "Watch out for people who confuse goals and tasks, because if they can’t make that distinction, you can’t trust them with responsibilities.",
    "Watch out for the unfocused and unproductive “theoretical should.”",
    "Communicate the plan clearly and have clear metrics conveying whether you are progressing according to it.",
    "Put things in perspective by going back before going forward.",
    "Escalate when you can’t adequately handle your responsibilities and make sure that the people who work for you are proactive about doing the same. 11  Perceive and Don’t Tolerate Problems",
    "If you’re not worried, you need to worry—and if you’re worried, you don’t need to worry.",
    "Design and oversee a machine to perceive whether things are good enough or not good enough, or do it yourself.",
    "Assign people the job of perceiving problems, give them time to investigate, and make sure they have independent reporting lines so that they can convey problems without any  fear of recrimination.",
    "Watch out for the “Frog in the Boiling Water Syndrome.”",
    "Beware of group-think: The fact that no one seems concerned doesn’t mean nothing is wrong.",
    "To perceive problems, compare how the outcomes are lining up with your goals.",
    "“Taste the soup.”",
    "Have as many eyes looking for problems as possible.",
    "“Pop the cork.”",
    "Realize that the people closest to certain jobs probably know them best.",
    "Be very specific about problems; don’t start with generalizations.",
    "Avoid the anonymous “we” and “they,” because they mask personal responsibility.",
    "Don’t be afraid to fix the difficult things.",
    "Understand that problems with good, planned solutions in place are completely different from those without such solutions.",
    "Think of the problems you perceive in a machinelike way. 12  Diagnose Problems to Get at Their Root Causes",
    "To diagnose well, ask the following questions: 1. Is the outcome good or bad? 2. Who is responsible for the outcome? 3. If the outcome is bad, is the Responsible Party incapable and/or is the design bad?",
    "Ask yourself: “Who should do what differently?”",
    "Identify at which step in the 5-Step Process the failure occurred.",
    "Identify the principles that were violated.",
    "Avoid Monday morning quarterbacking.",
    "Don’t confuse the quality of someone’s circumstances with the quality of their approach to dealing with the circumstances.",
    "Identifying the fact that someone else doesn’t know what to do doesn’t mean that you know what to do.",
    "Remember that a root cause is not an action but a reason.",
    "To distinguish between a capacity issue and a capability issue, imagine how the person would perform at that particular function if they had ample capacity.",
    "Keep in mind that managers usually fail or fall short of their goals for one (or more) of five reasons.",
    "Maintain an emerging synthesis by diagnosing continuously.",
    "Keep in mind that diagnoses should produce outcomes.",
    "Remember that if you have the same people doing the same things, you should expect the same results.",
    "Use the following “drill-down” technique to gain an 80/20 understanding of a department or sub-department that is having problems.",
    "Understand that diagnosis is foundational to both progress and quality relationships. 13  Design Improvements to Your Machine to Get Around Your Problems",
    "Build your machine.",
    "Systemize your principles and how they will be implemented.",
    "Create great decision-making machines by thinking through the criteria you are using to make decisions while you are making them.",
    "Remember that a good plan should resemble a movie script.",
    "Put yourself in the position of pain for a while so that you gain a richer understanding of what you’re designing for.",
    "Visualize alternative machines and their outcomes, and then choose.",
    "Consider second- and third-order consequences, not just first-order ones.",
    "Use standing meetings to help your organization run like a Swiss clock.",
    "Remember that a good machine takes into account the fact that people are imperfect.",
    "Recognize that design is an iterative process. Between a bad “now” and a good “then” is a “working through it” period.",
    "Understand the power of the “cleansing storm.”",
    "Build the organization around goals rather than tasks.",
    "Build your organization from the top down.",
    "Remember that everyone must be overseen by a believable person who has high standards.",
    "Make sure the people at the top of each pyramid have the skills and focus to manage their direct reports and a deep understanding of their jobs.",
    "In designing your organization, remember that the 5-Step Process is the path to success and that different people are good at different steps.",
    "Don’t build the organization to fit the people.",
    "Keep scale in mind.",
    "Organize departments and sub-departments around the most logical groupings based on “gravitational pull.”",
    "Make departments as self-sufficient as possible so that they have control over the resources they need to achieve their goals.",
    "Ensure that the ratios of senior managers to junior managers and of junior managers to their reports are limited to preserve quality communication and mutual understanding.",
    "Consider succession and training in your design.",
    "Don’t just pay attention to your job; pay attention to how your job will be done if you are no longer around.",
    "Use “double-do” rather than “double-check” to make sure mission-critical tasks are done correctly.",
    "Use consultants wisely and watch out for consultant addiction.",
    "Create an organizational chart to look like a pyramid, with straight lines down that don’t cross.",
    "Involve the person who is the point of the pyramid when encountering cross-departmental or cross-sub-departmental issues.",
    "Don’t do work for people in another department or grab people from another department to do work for you unless you speak to the person responsible for overseeing the other department.",
    "Watch out for “department slip.”",
    "Create guardrails when needed—and remember it’s better not to guardrail at all.",
    "Don’t expect people to recognize and compensate for their own blind spots.",
    "Consider the clover-leaf design.",
    "Keep your strategic vision the same while making appropriate tactical changes as circumstances dictate.",
    "Don’t put the expedient ahead of the strategic.",
    "Think about both the big picture and the granular details, and understand the connections between them.",
    "Have good controls so that you are not exposed to the dishonesty of others.",
    "Investigate and let people know you are going to investigate.",
    "Remember that there is no sense in having laws unless you have policemen (auditors).",
    "Beware of rubber-stamping.",
    "Recognize that people who make purchases on your behalf probably will not spend your money wisely.",
    "Use “public hangings” to deter bad behavior.",
    "Have the clearest possible reporting lines and delineations of responsibilities.",
    "Assign responsibilities based on workflow design and people’s abilities, not job titles.",
    "Constantly think about how to produce leverage.",
    "Recognize that it is far better to find a few smart people and give them the best technology than to have a greater number of ordinary people who are less well equipped.",
    "Use leveragers.",
    "Remember that almost everything will take more time and cost more money than you expect. 14  Do What You Set Out to Do",
    "Work for goals that you and your organization are excited about and think about how your tasks connect to those goals.",
    "Be coordinated and consistent in motivating others.",
    "Don’t act before thinking. Take the time to come up with a game plan.",
    "Look for creative, cut-through solutions.",
    "Recognize that everyone has too much to do.",
    "Don’t get frustrated.",
    "Use checklists.",
    "Don’t confuse checklists with personal responsibility.",
    "Allow time for rest and renovation.",
    "Ring the bell. 15  Use Tools and Protocols to Shape How Work Is Done",
    "Having systemized principles embedded in tools is especially valuable for an idea meritocracy.",
    "To produce real behavioral change, understand that there must be internalized or habitualized learning.",
    "Use tools to collect data and process it into conclusions and actions.",
    "Foster an environment of confidence and fairness by having clearly-stated principles that are implemented in tools and protocols so that the conclusions reached can be assessed by tracking the logic and data behind them. 16  And for Heaven’s Sake, Don’t Overlook Governance!",
    "To be successful, all organizations must have checks and balances.",
    "Even in an idea meritocracy, merit cannot be the only determining factor in assigning responsibility and authority.",
    "Make sure that no one is more powerful than the system or so important that they are irreplaceable.",
    "Beware of fiefdoms.",
    "Make clear that the organization’s structure and rules are designed to ensure that its checks-and-balances system functions well.",
    "Make sure reporting lines are clear.",
    "Make sure decision rights are clear.",
    "Make sure that the people doing the assessing 1) have the time to be fully informed about how the person they are checking on is doing, 2) have the ability to make the assessments, and 3) are not in a conflict of interest that stands in the way of carrying out oversight effectively.",
    "Recognize that decision makers must have access to the information necessary to make decisions and must be trustworthy enough to handle that information safely.",
    "Remember that in an idea meritocracy a single CEO is not as good as a great group of leaders.",
    "No governance system of principles, rules, and checks and balances can substitute for a great partnership."]